Revit 2027 API
MullionTypeSet.Erase Method
Removes a specified mullion type from the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	MullionType item
)
Public Overridable Function Erase (
	item As MullionType
) As Integer
public:
virtual int Erase(
	MullionType^ item
)
abstract Erase :
        item : MullionType -> int
override Erase :
        item : MullionType -> int
Parameters
item MullionType
The mullion type to be erased.
Return Value
Int32
The number of mullion types that were erased from the set.
See Also
Reference
MullionTypeSet Class
Autodesk.Revit.DB Namespace